### [DataFrame 연산 - 3]
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- 연산 수행 메서드 활용
- NaN에 대한 값 설정으로 연산 수행 가능해짐

In [1]:
# [1] 모듈 로딩
import pandas as pd
import numpy as np    # 빈 칸을 의미하는 표현법 사용 위해서

In [2]:
# [2] 데이터 준비
data={'A':[98,79, np.nan, 52],
      'B':[78,99,70,42]}

In [3]:
# [3] Dict 데이터 ==> DataFrame 형태로 저장
DF1=pd.DataFrame(data)
DF1

      A   B
0  98.0  78
1  79.0  99
2   NaN  70
3  52.0  42

In [4]:
# [4] 연산수행
# - DataFrame + 숫자
DF1.add(5, fill_value=0.0)

       A    B
0  103.0   83
1   84.0  104
2    5.0   75
3   57.0   47

In [6]:
# - DataFrame + DataFrame
DF1.add(DF1, fill_value=-10.0)

       A    B
0  206.0  166
1  168.0  208
2    NaN  150
3  114.0   94

In [9]:
# - DataFrame + DataFrame
DF1.add(DF1+10, axis=1)

       A    B
0  206.0  166
1  168.0  208
2    NaN  150
3  114.0   94

In [10]:
data2={'A':[98,79,20,52],
      'B':[78,99,70,42]}

DF2=pd.DataFrame(data2)
DF2

    A   B
0  98  78
1  79  99
2  20  70
3  52  42

In [11]:
DF1.add(DF2, fill_value=0.0)

       A    B
0  196.0  156
1  158.0  198
2   20.0  140
3  104.0   84